app/controllers/styles_controller.rb

  def index
    @styles = Style.all
---
SELECT "styles".* FROM "styles"

  def show
    @style = Style.find(params[:id])
---
SELECT "styles".* FROM "styles" WHERE "styles"."id" = $1 LIMIT 1  [["id", "63"]]

  def edit
    @style = Style.find(params[:id])
---
SELECT "styles".* FROM "styles" WHERE "styles"."id" = $1 LIMIT 1  [["id", "62"]]

  def create
    @style = Style.new(style_params)

    respond_to do |format|
      if @style.save
---
INSERT INTO "styles" ("created_at", "name", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", Sat, 01 Feb 2014 22:59:08 UTC +00:00], ["name", "MyString"], ["updated_at", Sat, 01 Feb 2014 22:59:08 UTC +00:00]]

  def update
    @style = Style.find(params[:id])
---
SELECT "styles".* FROM "styles" WHERE "styles"."id" = $1 LIMIT 1  [["id", "64"]]

  def destroy
    @style = Style.find(params[:id])
    @style.destroy
---
SELECT "styles".* FROM "styles" WHERE "styles"."id" = $1 LIMIT 1  [["id", "56"]]
DELETE FROM "styles" WHERE "styles"."id" = $1  [["id", 56]]