rails/app/controllers/climbers_controller.rb

SELECT "climbers".* FROM "climbers" WHERE "climbers"."id" = $1 LIMIT 1  [["id", "2"]]
---
  def edit
    @climber = Climber.find(params[:id])

SELECT "climbers".* FROM "climbers" WHERE "climbers"."id" = $1 LIMIT 1  [["id", "4"]]
---
  def show
    add_breadcrumb @climber.full_name, climber_path(@climber)
    @climber = Climber.find(params[:id])

SELECT "climbers".* FROM "climbers" WHERE "climbers"."id" = $1 LIMIT 1  [["id", "7"]]
---
  def update
      @climber = Climber.find(params[:id])