rails/app/controllers/climbs_controller.rb

SELECT "climbs".* FROM "climbs" ORDER BY name asc LIMIT 1 OFFSET 0
SELECT "styles".* FROM "styles"
SELECT COUNT(*) FROM "climbs"
---
  def index
    if params[:styles]
      @climbs = Climb.order_by_join(params[:join_model], sort_column, sort_direction).page(params[:page]).where(:style_id => params[:styles])
      session[:style_id] = params[:styles]
      @style = Style.find(params[:styles])
      @title = "Climbs for style #{@style.name}"
      @keywords = "#{@style.name}"
      @description = "List of Hard #{@style.name} Ascents"
    elsif params[:area_id]
      @area = Area.find(params[:area_id])
      @climbs = @area.climbs.order_by_join(params[:join_model], sort_column, sort_direction).page(params[:page])