rails/app/controllers/home_controller.rb

  def index

    set_meta_tags :description => "HardClimbs.info seeks to catalog the hardest sport climbs and boulder problems in the world"
    set_meta_tags :keywords => "rock climbing,bouldering,sport climbing"

    #@climbers = Climber.all
    @areas = Area.all
---
SELECT "areas".* FROM "areas"