app/views/layouts/_navigation.html.erb

       </li>
       <% Style.all.each do |s| %>
---
SELECT "styles".* FROM "styles"